## Pandas 학습

### merge
   - 데이터를 합칠때 컬럼을 옆으로 눌려서 합침
   - DB 의 Join 과 같은 기능이다.

In [100]:
import pandas as pd

In [101]:
# header : 엑셀에서 필요없는 제목줄 등 없애기
# skipfooter : 엑셀에서 아래쪽에 필요없는 행들을 삭제
df_left = pd.read_excel('../day01/data/sample_1.xlsx', header=1, skipfooter=2)
df_left

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [102]:
df_right = pd.read_excel('../day01/data/sample_codemaster.xlsx')
df_right

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [103]:
df_total = pd.merge(left=df_left, right=df_right, how='left',left_on='국적코드',right_on='국적코드')

In [104]:
df_total

  국적코드  성별    입국객수    전년동기  국적명
0  A01  남성  106320   85815   일본
1  A01  여성  191436  125241   일본
2  A31  남성     319     299  NaN
3  A31  여성      42      54  NaN
4  A18  남성  158912  124486   중국
5  A18  여성  232943  163466   중국

In [105]:
# DB : Inner Join 과 같다.
df_total = pd.merge(left=df_left, right=df_right, how='inner',left_on='국적코드',right_on='국적코드')
df_total

  국적코드  성별    입국객수    전년동기 국적명
0  A01  남성  106320   85815  일본
1  A01  여성  191436  125241  일본
2  A18  남성  158912  124486  중국
3  A18  여성  232943  163466  중국

### append
- 데이터를 합칠 때 데이터 수(row)를 늘도록 합치는 방법
- DB에 UNION 과 동일하다.

In [106]:
# append 를 하기위한 데이터 생성
df_left2 = pd.read_excel('./data/sample_2.xlsx',header=1, skipfooter=2, usecols="A:D")
df_left2

  국적코드  성별    입국객수    전년동기
0  A01  남성   92556   75992
1  A01  여성  163737  115397
2  A18  남성  155540  129908
3  A18  여성  249023  191236

In [107]:
# pandas 2.x 버전 이상에서는 append() -> concat() 으로 대체됨!
# df_all = df_left.append(df_left2)

In [108]:
pd.concat([df_left,df_left2])

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466
0  A01  남성   92556   75992
1  A01  여성  163737  115397
2  A18  남성  155540  129908
3  A18  여성  249023  191236

In [109]:
# 잘못된 방법
pd.concat([df_total, df_left2])

  국적코드  성별    입국객수    전년동기  국적명
0  A01  남성  106320   85815   일본
1  A01  여성  191436  125241   일본
2  A18  남성  158912  124486   중국
3  A18  여성  232943  163466   중국
0  A01  남성   92556   75992  NaN
1  A01  여성  163737  115397  NaN
2  A18  남성  155540  129908  NaN
3  A18  여성  249023  191236  NaN

In [110]:
# df_left2 를 가지고 df_total2 를 만든다.
df_total2 = pd.merge(left=df_left2, right=df_right, how='left',left_on='국적코드',right_on='국적코드')
df_total2

  국적코드  성별    입국객수    전년동기 국적명
0  A01  남성   92556   75992  일본
1  A01  여성  163737  115397  일본
2  A18  남성  155540  129908  중국
3  A18  여성  249023  191236  중국

In [111]:
df_all = pd.concat([df_total, df_total2], ignore_index=True)
# ignore_index = 새로운 인덱스를 만들어주는 옵션

In [112]:
df_all

  국적코드  성별    입국객수    전년동기 국적명
0  A01  남성  106320   85815  일본
1  A01  여성  191436  125241  일본
2  A18  남성  158912  124486  중국
3  A18  여성  232943  163466  중국
4  A01  남성   92556   75992  일본
5  A01  여성  163737  115397  일본
6  A18  남성  155540  129908  중국
7  A18  여성  249023  191236  중국

In [113]:
# DataFrame 저장 to_xxx() 함수로 각각의 종류별로 저장가ㅡㄴㅇ
df_all.to_excel('./data/df_all.xlsx', index=False)

In [114]:
# 기준년월 확인 
df_total['기준년월'] = '2019-11'
df_total

  국적코드  성별    입국객수    전년동기 국적명     기준년월
0  A01  남성  106320   85815  일본  2019-11
1  A01  여성  191436  125241  일본  2019-11
2  A18  남성  158912  124486  중국  2019-11
3  A18  여성  232943  163466  중국  2019-11

In [115]:
df_total2['기준년월'] = '2019-12'
df_total2

  국적코드  성별    입국객수    전년동기 국적명     기준년월
0  A01  남성   92556   75992  일본  2019-12
1  A01  여성  163737  115397  일본  2019-12
2  A18  남성  155540  129908  중국  2019-12
3  A18  여성  249023  191236  중국  2019-12

In [116]:
df_all = pd.concat([df_total,df_total2],ignore_index=True)
df_all

  국적코드  성별    입국객수    전년동기 국적명     기준년월
0  A01  남성  106320   85815  일본  2019-11
1  A01  여성  191436  125241  일본  2019-11
2  A18  남성  158912  124486  중국  2019-11
3  A18  여성  232943  163466  중국  2019-11
4  A01  남성   92556   75992  일본  2019-12
5  A01  여성  163737  115397  일본  2019-12
6  A18  남성  155540  129908  중국  2019-12
7  A18  여성  249023  191236  중국  2019-12

### Pivot 테이블
- 통계를 내면서 테이블을 세로로 된 DF를 가로로 바꿔주는 기능
-

In [117]:
# aggfunc -> sum:총합/mean:평균/min,max:최소,최대값/median:중앙값/count:갯수/unique:객수(중복제거)
df_all.pivot_table(values='입국객수',index='국적코드',columns='기준년월', aggfunc='sum')

기준년월  2019-11  2019-12
국적코드
A01    297756   256293
A18    391855   404563